{
  "links": {
    "home": "Início",
    "about": "Sobre",
    "projects": "Projetos",
    "skills": "Habilidades",
    "experience": "Experiência",
    "contact": "Contato"
  },
  "intro": {
    "description": "Olá, <b>eu sou Dionmax.</b> Sou um <b>desenvolvedor Full-stack</b> com <b>4 anos</b> de experiência.",
    "contact_me": "Entre em contato",
    "contact_me_at": "Por favor, entre em contato comigo em ",
    "contact_me_through": " ou através deste formulário",
    "email": "Email",
    "my_email": "dionmaxfn+portfolio@gmail.com",
    "message": "Mensagem",
    "download_cv": "Baixar CV"
  },
  "about": {
    "heading": "Sobre Mim",
    "description1": "Eu sou Dionmax. Sou um <b>desenvolvedor full-stack com 4 anos de experiência</b> desenvolvendo para empresas privadas. Eu gosto de criar websites e aplicações. Minha especialidade é PHP e React.",
    "description2": "Após me formar em <b>Ciência da Computação</b>, decidi seguir minha paixão pela programação. Antes mesmo de me formar, eu já estava trabalhando em uma empresa e logo me tornei um desenvolvedor full-stack.",
    "description3": "Minha parte favorita da programação é a resolução de problemas. Adoro a sensação de finalmente encontrar uma solução para um problema. <b>Minha principal stack é <i>React</i>, <i>PHP</i>, <i>SQL</i>.</b>",
    "description4": "Também estou muito familiarizado com <b><i>TypeScript</i> e <i>Python</i>, assim como <i>C#</i>, <i>Java</i> e <i>C++</i></b>. Estou sempre procurando aprender novas tecnologias. Atualmente, estou procurando uma posição em tempo integral como desenvolvedor de software.",
    "description5": "Quando não estou programando, gosto de jogar videogame, assistir filmes e brincar com meu cachorro. Também gosto de aprender coisas novas. Atualmente, estou aprendendo sobre <b>ciência de dados</b> para me tornar um profissional na área."
  },
  "projects": {
    "heading": "Projetos",
    "1": {
      "title": "Coletum",
      "description": "Trabalhei como desenvolvedor full-stack nesse projeto por 2 anos. O intuito era coletar e ordenar dados para empresas."
    },
    "2": {
      "title": "OpenTuna",
      "description": "Trabalhei como front-end nesse projeto. O objetivo era organizar e mapear dados da pesca do atum em toda costa brasileira."
    },
    "3": {
      "title": "PropesqWeb",
      "description": "Trabalhei como full-stack nesse projeto. Ordenando e gerando relatórios sobre os dados de toda pesca no território brasileiro."
    },
    "4": {
      "title": "AxisPointe",
      "description": "Trabalhei como full-stack nesse projeto. Criando relatórios detalhados e gráficos sobre os dados de construção em todo território da Califórnia."
    }
  },
  "skills": {
    "heading": "Habilidades"
  },
  "experiences": {
    "heading": "Experiências",
    "1": {
      "title": "Curso completo de C# Programação Orientada a Objetos + Projetos",
      "location": "Udemy Academy",
      "description": "Aprendi sobre programação orientada a objetos com C#. Aprendi sobre classes, objetos, herança, polimorfismo, encapsulamento, interfaces, delegates, eventos, exceções, coleções, expressões lambda, LINQ, Entity Framework e muito mais.",
      "date": "AGO 2019"
    },
    "2": {
      "title": "Graduação em Ciência da Computação",
      "location": "Itajaí, SC, Brasil",
      "description": "Formei-me após 5 anos de estudo. Consegui um emprego remoto antes de terminar meus estudos. E tenho estudado desde então.",
      "date": "JAN 2016 - FEV 2021"
    },
    "3": {
      "title": "Desenvolvedor Full-Stack",
      "location": "Itajaí, SC, Brasil",
      "description": "Trabalhei em projetos web com PHP e Symfony2, projetos com Typescript e React, e outras funções envolvendo banco de dados com R e SQL.",
      "date": "NOV 2019 - DEZ 2023"
    },
    "4": {
      "title": "Python para análise de dados e ciência de dados",
      "location": "Data Science Academy",
      "description": "Ciência de dados e aprendizado de máquina com Python. Aprendi sobre análise de dados, visualização de dados e aprendizado de máquina. Bem como as bibliotecas Python Pandas, Numpy, Matplotlib e Seaborn. Também aprendi sobre aprendizado de máquina com Scikit-learn e TensorFlow.",
      "date": "SET 2023 - FEV 2024"
    },
    "5": {
      "title": "Formação Cientista de Dados: O curso completo",
      "location": "Udemy Academy",
      "description": "Adquiri uma base sólida em diversas áreas da Ciência de Dados, desde modelagem preditiva com Deep Learning até técnicas de banco de dados e computação na nuvem. Isso inclui também fundamentos importantes de estatística, Python, R, SQL, e NoSQL, além de boas práticas em visualização de dados.",
      "date": "JUL 2024"
    },
    "6": {
      "title": "Formação Cientista de Dados: Tópicos Avançados",
      "location": "Udemy Academy",
      "description": "Aprendi tópicos avançados em Ciência de Dados, cobrindo áreas importantes como Inteligência Artificial Explicável (XAI), técnicas de modelagem e avaliação, além de métodos para lidar com conjuntos de dados desbalanceados e classificação multi-label.",
      "date": "SET 2024"
    },
    "7": {
      "title": "Formação Completa Inteligência Artificial e Machine Learning",
      "location": "Udemy Academy",
      "description": "Aprofundei meus conhecimentos em Inteligência Artificial, explorando conceitos avançados como Inteligência Artificial Explicável (XAI), estratégias para modelagem e avaliação de modelos, além de abordagens específicas para tratar conjuntos de dados desbalanceados e tarefas de classificação multi-rótulo.",
      "date": "JAN 2025"
    },
    "8": {
      "title": "Desenvolvedor de Software",
      "location": "El Cajon, Califórnia, Estados Unidos",
      "description": "Atualmente desenvolvendo software usando PHP, Symfony5, PostgresSQL.",
      "date": "FEV 2025 - Presente"
    }
  },
  "button": {
    "submit": "Enviar"
  },
  "footer": {
    "heading": "2024 Dionmax. Todos os direitos reservados.",
    "about": "Sobre este site:",
    "description": "construído com React, Next.js (App Router & Server Actions), Tailwind CSS, Framer Motion, React Email & Resend e TypeScript."
  }
}
